data_assignment/airfoil_geometry/second_try/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    Side
    {
        type            patch;
        physicalType    patch;
        nFaces          22344;
        startFace       20748;
    }
    Inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          0;
        startFace       43092;
    }
    Airfoil
    {
        type            patch;
        physicalType    patch;
        nFaces          0;
        startFace       43092;
    }
    Outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          0;
        startFace       43092;
    }
    Flap
    {
        type            patch;
        physicalType    patch;
        nFaces          0;
        startFace       43092;
    }
    defaultFaces
    {
        type            patch;
        nFaces          3192;
        startFace       43092;
    }
)

// ************************************************************************* //
